pages/reading-group.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-16 Thu 10:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Pedagogy Reading Group</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../globalStyle.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">A Pedagogy Reading Group</h1>
<p>
This is the landing page for an informal reading group on pedagogy at
Boston University.  We meet a couple times a semester to discuss
anything and everything pedagogy and teaching.  The intended audience
is anyone teaching (or who will teach) courses at BU who wants to
think more about their practice.
</p>

<p>
If you want to be added to the email list for this group (or if you
want to be removed from the email list), please send a message to
<code>nmmull at bu dot edu</code>.  <b>If you're interesting in leading a
discussion</b> on a paper/book chapter that you read, or just a discussion
of the form "this is what I've been thinking about recently", please
send an message.
</p>

<div id="outline-container-org024c765" class="outline-2">
<h2 id="org024c765">Fall 2024</h2>
<div class="outline-text-2" id="text-org024c765">
<p>
For the fall 2024 semester we'll be meeting on <b>Fridays 12-1PM in CDS 950</b>.
See the sections below for dates and topics.
</p>
</div>
<div id="outline-container-orgec25f4d" class="outline-3">
<h3 id="orgec25f4d">2024-10-04 SIGCE 2024 Playlist</h3>
<div class="outline-text-3" id="text-orgec25f4d">
<ul class="org-ul">
<li><b>discussion leader:</b> Nathan Mull</li>
<li><p>
<b>outline:</b> There were a bunch of interesting-looking papers out of
<a href="https://sigcse2024.sigcse.org">SIGCE</a> this year, I'd like to chat about some of the ones that caught
my eye.  The two main papers I'd like to discuss are
</p>
<ul class="org-ul">
<li><a href="https://dl.acm.org/doi/10.1145/3626252.3630846">Experiences of Undergraduate Computer Science Students Living with Mental Health Conditions</a></li>
<li><a href="https://dl.acm.org/doi/10.1145/3626252.3630953">Transforming Grading Practices in the Computing Education Community</a></li>
</ul>
<p>
They're kind of hard to read, but I'd like to more directly confront
the challenges that students face outside of the courses I teach.  I
think there's a lot of space here to talk about our experiences,
failures, and solutions (in any field).
</p>

<p>
We likely won't have time to discuss them but I also want to include
these papers, which are more specific to computer science.
</p>
<ul class="org-ul">
<li><a href="https://dl.acm.org/doi/10.1145/3626252.3630904">Participatory Governance in the Computer Science Theory Classroom</a></li>
<li><a href="https://dl.acm.org/doi/abs/10.1145/3626252.3630871">How We Manage an Army of Teaching Assistants: Experience Report on Scaling a CS1 Course</a></li>
</ul>
<p>
Though not perfect, I think they offer potential solutions to
creating more accessible computer science courses, even at scale.
</p></li>
<li><b>Zoom link:</b> <i>past</i></li>
</ul>
</div>
</div>
<div id="outline-container-orgd8006cb" class="outline-3">
<h3 id="orgd8006cb">2024-11-08 Trauma-Informed Teaching</h3>
<div class="outline-text-3" id="text-orgd8006cb">
<ul class="org-ul">
<li><b>discussion leader:</b> Tori Lee</li>
<li><b>outline:</b> We'll discuss trauma-informed teaching and mental health
and try to take away some practical/actionable steps from our
readings for things we can implement into spring courses, e.g.,
small steps we can take in planning our syllabi and assignments
(acknowledging that CS courses typically don’t actually teach
<i>about</i> sexual assault, but certainly teach to students who have
experienced it).</li>
<li><b>Zoom link:</b> <a href="https://bostonu.zoom.us/j/96468715816?pwd=lzNk2LFUiCVPcFF3ihXVcvrnHbENye.1">link</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf4fa8c3" class="outline-3">
<h3 id="orgf4fa8c3">2024-12-06 Microintervention Strategies</h3>
<div class="outline-text-3" id="text-orgf4fa8c3">
<ul class="org-ul">
<li><b>discussion leader:</b> Anna Ward</li>
<li><b>outline:</b> We'll look at the first three chapters of
<a href="https://www.wiley.com/en-us/Microintervention+Strategies%3A+What+You+Can+Do+to+Disarm+and+Dismantle+Individual+and+Systemic+Racism+and+Bias-p-9781119769989">Microintervention Strategies</a> and discuss how these strategies can be
applied to interacting with students and designing material.</li>
<li><b>Zoom link:</b> <a href="https://bostonu.zoom.us/j/98846086217?pwd=mxxFfQblPeXjCOUcBai44HastEaRoT.1">link</a></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
